Revit 2024 API
MEPBuildingConstructionSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual MEPBuildingConstructionSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As MEPBuildingConstructionSetIterator
Visual C++
public:
virtual MEPBuildingConstructionSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace